[
    {
        "title": "Bulawayo residents object to ZPC takeover of thermal power plant",
        "body": "<p><b>By NQOBANI NDLOVU</b></p><p>BULAWAYO residents are objecting to attempts by the Zimbabwe Power Company (ZPC) to take over the city council-owned owned thermal power station arguing this was against the spirit of devolution. ZPC recently applied for an amendment of the Bulawayo Power Station license to give it a 20 -year license to enable it to produce 120 megawatts of power to be fed into the national grid. According to the Zimbabwe Energy Regulatory Authority, residents and other interested stakeholders have up to January 17, to lodge objections. According to Zera, ZPC intends to boost electricity generation from the current 90MW to 120MW in the next two decades once its application is approved. Council has been battling to regain control of the station which was handed over to Zesa more than two decades ago.</p><p>'It is in this regard that there is a need for ZPC to do proper consultations with residents and the BCC who are the key stakeholders to this very important asset. ZPC has not been transparent in the manner they have been declaring actual incomes accumulating from Bulawayo Power Station,' Bulawayo Progressive Residents Association (BPRA) acting coordinator Emmanuel Ndlovu said.   Ndlovu also argued attempts to nationalise the Bulawayo Power Station ran against the spirit of devolution as enshrined in the Constitution.</p><p>'Hence the nationalization of the power station will be the violation of the principles of devolution and thus acting ultra-virus to the constitution. Therefore, it defeats the whole purpose of devolution if ZPC proceeds to amend their license and nationalise Bulawayo Power Station which is an essential asset to Bulawayo metropolitan province,' Ndlovu added. Local governance expert Davison Muchandenyika said the Bulawayo and Harare thermal power stations were local authority assets which must not be tampered with without consent from key stakeholders.</p><p>'They (power stations) can't be transferred at zero cost,' he said. 'A proper asset evaluation must be done if it's going to be sold. If for a leased, councils should determine/yearly rentals. No need for national agencies to decide on behalf of the BCC.' India in November last year extended a $23 million credit loan facility to the ZPC to boost power generation at the Bulawayo Power Station. ZPC currently operates four coal-fired power stations, Hwange, Bulawayo, Munyati and Harare thermal stations, and the hydro powered Kariba South Power Station.</p>",
        "banner": "assets/img/news/power.jpg",
        "date": "30-01-2019",
        "excerpt": "BULAWAYO residents are objecting to attempts by...",
        "category": "Electricity"
    },
    {
        "title": "Bulawayo Councillors Agree To Resident’s Request To Declare Assets",
        "body": "<p>Bulawayo councillors have given in to a request by the Bulawayo Progressive Residents&rsquo; Association (BPRA) to declare their assets.</p><p>Councillors Rodney Jele (Ward 22) and Arnold Batirai (Ward 24) handed over their list of assets to the BPRA leadership last week. The assets were not announced to the residents that had gathered at Nkulumane Hall. The councillors said they were waiting for their parent party, MDC-Alliance to give them the go ahead. They said the MDC Alliance leadership advised them to wait until next month for undisclosed reasons. Said Councillor Jere:</p><p>I&rsquo;m not going to announce today because I haven&rsquo;t been given the permission to do so. You all know that I come from a political party, which has not given us the green light to do so. We have been told just to make our declarations in writing. BPRA wrote to us requesting that we declare our assets. So as a sign of commitment towards that pledge I am handing over a list containing the number of assets I have.&nbsp;The party will only allow us to declare our assets after 8 December. That&rsquo;s when I will announce publicly the assets I have. I hope the other councillors will also do the same considering that this programme of declaring assets is voluntary.</p>",
        "banner": "assets/img/news/residents.jpg",
        "date": "29-01-2019",
        "excerpt": "Bulawayo councillors have given in to a request...",
        "category": "News"
    },
    {
        "title": "BCC blocks Bulawayo power station licence renewal bid",
        "body": "<p><strong>Vusumuzi Dube, Senior Reporter</strong><br />A MOVE by the Zimbabwe Power Company (ZPC) to renew their power generation licence for the Bulawayo Power Station has taken a dramatic twist after the Bulawayo City Council tabled their objection saying they were the owners of the power station.</p><p>In December last year the Zimbabwe Energy Regulatory Authority (Zera) announced in a public notice that it had received an application from ZPC for amendment of the electricity generation licence to be extended by 20 years from 2024.</p><p>However, BCC has since written to Zera objecting on licence renewal bid arguing among other issues that they were the owners of the power station and ZPC were just mere occupants who were further neglecting in their obligation of paying royalties for the use of the station.</p><p>The objection by the local authority comes after Bulawayo residents under the Bulawayo Progressive Residents&rsquo; Association also wrote to Zera noting their objections to the renewal bid. Zera has since halted the process of renewing the power generation licence, instead advising ZPC to address the objections raised by both BCC and BPRA.</p><p>Detailing the local authority&rsquo;s objection, the city&rsquo;s Town Clerk, Mr Christopher Dube said the local authority reserves the right, as owners of the property, to review the continued occupancy of ZPC.</p><p>&ldquo;The City of Bulawayo are the owners of the Power Station and was not consulted on the matter. The occupier of the property, ZPC, has neglected or failed to pay royalties or any other recognition for its occupancy. This is despite court orders establishing the legitimacy of such payments. The matter is currently before the courts for claiming such payments. The council reserves the right, as owners of the property, to review the continued occupancy of ZPC. The occupant has been not been dealing with the city in good faith in that it initially paid royalties and stopped unilaterally without any discussion with property owner,&rdquo; said Mr Dube.</p><p>The Town Clerk further revealed that when Zesa transformed itself to various companies there was a request by BCC for shares in lieu of its assets that were taken over but this was not done without even the courtesy of an explanation.</p><p>&ldquo;The company is now refusing or neglecting to pay royalties which its predecessor had been paying. The occupier has, despite its own failure to honour its obligations, continued to charge the owner a commercial tariff, subjected the owner to cut offs and litigation for any outstanding payments for electricity consumed. The electricity tariff is the biggest contributor to council tariffs, especially the water tariff which affects the residents of Bulawayo, who funded the construction of the Power Station, hence the residents&rsquo; association&rsquo;s objection as well. The residents have continued to petition the council to protect its investment and ensure they derive value from its asset,&rdquo; said the Town Clerk.</p>Meanwhile, in a letter addressed to ZPC from Zera acting chief executive officer, Mr Eddington Mazambani, the power utility was advised to address the objections as the licence could not be reviewed as long as the local authority and residents were against the move. 'Please be advised that based on a public notice on the application which solicited for written representations from members of the public on the development, Zera received written representations from the Bulawayo City Council and Bulawayo Progressive Residents’ Association in which they objected to amendment of electricity generation licence for Bulawayo Power Station.'ZPC is therefore requested to address as a matter of urgency, the issues raised by Bulawayo City Council and Bulawayo Progressive Residents Association as no further processing of the application can be done before the objections are addressed,' reads part of the letter. The letter, which is dated 24 January was also copied to BCC and the residents’ association. In their objection, Bulawayo Progressive Residents’ Association co-ordinator, Mr Emmanuel Ndlovu had noted that the ramifications may be far reaching if left unchecked as there had been no consultations with either council or residents in the applicants’ quest to seek both geographical and time extensions. Recently, ZPC announced that it was reviewing a draft contract received from India Export and Import Bank for the $87 million Bulawayo Thermal Power Station repowering project. The ZPC/ India-Exim Bank deal was clinched in 2015 and the financial institution last month announced having extended an additional $23 million line of credit for rehabilitation of Bulawayo Thermal Power Station. The thermal plant’s refurbishment process includes, among other activities, replacing old boilers with state-of-the-art boilers.The power plant, which was built 60 years ago, has been failing to meet its installed generation capacity of 120MW due to ageing equipment, among other reasons.",
        "banner": "assets/img/news/pylon.jpg",
        "date": "28-01-2019",
        "excerpt": "A MOVE by the Zimbabwe Power Company (ZPC)...",
        "category": "Electricity"
    }
]