[
    {
        "title": "Bulawayo Dams 60% Full, Can Last 30 Months Only",
        "body": "<p>Bulawayo City Council whose supply dams are 60 percent full says the water is enough to last the city 30 months.</p><p>According to the Zimbabwe National Water Authority (Zinwa) statistics on dam levels, the city’s six supply dams were at an average of 60 percent full as at December 24, down from 65 percent recorded on November 6.</p><p>In its latest council report, the local authority said water in the dams can last the city up to 30 months even if it does not rain.</p><p>'The monthly average drawdown calculated using the period 2012-2014 when there were no inflows was about 8 million m3 per month. Using this figure for drawdown and usable storage of 244 million m3, the expected theoretical depletion period translates to 30,9 months,' read the report.</p>",
        "banner": "assets/img/water.jpg",
        "date": "3 hours ago",
        "excerpt": "Bulawayo City Council whose supply dams...",
        "category": "Water"
    },
    {
        "title": "Repowering plans for Bulawayo Power Station",
        "body": "<p>The Bulawayo Power Station’s licence tenure is set to be extended by 20 years from 2024 after the Zimbabwe Power Company (ZPC) applied for its extension as a result of the repowering exercise.</p><p>Recently, ZPC announced that it was reviewing a draft contract received from India Export and Import Bank for the $87 million Bulawayo Thermal Power Station repowering project. The ZPC/India-Exim Bank deal was clinched in 2015 and the financial institution last month announced having extended an additional $23 million line of credit for rehabilitation of Bulawayo Thermal Power Station.</p><p>In a public notice yesterday, the Zimbabwe Energy Regulatory Authority (Zera) said it had received an application from ZPC for amendment of the electricity generation licence GC0023 for the Bulawayo Power Station for generation and supply of electricity in the country.</p><p>The application would entail the extension of the tenure of the generation licence issued to Zimbabwe Power Company for the Bulawayo Power Station by 20 years from 2024.</p>",
        "banner": "assets/img/electricity.jpg",
        "date": "2 January 2019",
        "excerpt": "The Bulawayo Power Station’s licence tenure...",
        "category": "Water"
    }
]